Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SLEEPCON1.h
#define SLEEPCON1_PWRDOWN_WAIT_IGN_FRO2PDR_MASK  (0x4U)
#define SLEEPCON1_PWRDOWN_WAIT_IGN_FRO2PDR_SHIFT (2U)
/*! IGN_FRO2PDR - Ignore FRO2 Power Down Ready Signal
 *  0b0..Waits
 *  0b1..Ignores
 */
#define SLEEPCON1_PWRDOWN_WAIT_IGN_FRO2PDR(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PWRDOWN_WAIT_IGN_FRO2PDR_SHIFT)) & SLEEPCON1_PWRDOWN_WAIT_IGN_FRO2PDR_MASK)

#define SLEEPCON1_PWRDOWN_WAIT_IGN_LPOSCPDR_MASK (0x8U)
#define SLEEPCON1_PWRDOWN_WAIT_IGN_LPOSCPDR_SHIFT (3U)
/*! IGN_LPOSCPDR - Ignore LPOSC Power Down Ready Signal
 *  0b0..Waits
 *  0b1..Ignores
 */
#define SLEEPCON1_PWRDOWN_WAIT_IGN_LPOSCPDR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PWRDOWN_WAIT_IGN_LPOSCPDR_SHIFT)) & SLEEPCON1_PWRDOWN_WAIT_IGN_LPOSCPDR_MASK)
/*! @} */

/*! @name HW_WAKE - eDMA Wakeup Enable */
/*! @{ */

#define SLEEPCON1_HW_WAKE_HWWK_SRC1_MASK         (0x2U)
#define SLEEPCON1_HW_WAKE_HWWK_SRC1_SHIFT        (1U)
/*! HWWK_SRC1 - eDMA Wakeup Source 1
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_HW_WAKE_HWWK_SRC1(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_HWWK_SRC1_SHIFT)) & SLEEPCON1_HW_WAKE_HWWK_SRC1_MASK)

#define SLEEPCON1_HW_WAKE_HWWK_SRC2_MASK         (0x4U)
#define SLEEPCON1_HW_WAKE_HWWK_SRC2_SHIFT        (2U)
/*! HWWK_SRC2 - eDMA Wakeup Source 2
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_HW_WAKE_HWWK_SRC2(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_HWWK_SRC2_SHIFT)) & SLEEPCON1_HW_WAKE_HWWK_SRC2_MASK)

#define SLEEPCON1_HW_WAKE_HWWK_SRC4_MASK         (0x10U)
#define SLEEPCON1_HW_WAKE_HWWK_SRC4_SHIFT        (4U)
/*! HWWK_SRC4 - eDMA Wakeup Source 4
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_HW_WAKE_HWWK_SRC4(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_HWWK_SRC4_SHIFT)) & SLEEPCON1_HW_WAKE_HWWK_SRC4_MASK)
/*! @} */

/*! @name HW_WAKE_SET - eDMA Wakeup Set */
/*! @{ */

#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC1_SET_MASK (0x2U)
#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC1_SET_SHIFT (1U)
/*! HWWK_SRC1_SET - eDMA Wakeup Source 1 Enable
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC1_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_SET_HWWK_SRC1_SET_SHIFT)) & SLEEPCON1_HW_WAKE_SET_HWWK_SRC1_SET_MASK)

#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC2_SET_MASK (0x4U)
#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC2_SET_SHIFT (2U)
/*! HWWK_SRC2_SET - eDMA Wakeup Source 2 Enable
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC2_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_SET_HWWK_SRC2_SET_SHIFT)) & SLEEPCON1_HW_WAKE_SET_HWWK_SRC2_SET_MASK)

#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC4_SET_MASK (0x10U)
#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC4_SET_SHIFT (4U)
/*! HWWK_SRC4_SET - eDMA Wakeup Source 4 Enable
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_HW_WAKE_SET_HWWK_SRC4_SET(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_SET_HWWK_SRC4_SET_SHIFT)) & SLEEPCON1_HW_WAKE_SET_HWWK_SRC4_SET_MASK)
/*! @} */

/*! @name HW_WAKE_CLR - eDMA Wakeup Clear */
/*! @{ */

#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC1_CLR_MASK (0x2U)
#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC1_CLR_SHIFT (1U)
/*! HWWK_SRC1_CLR - eDMA Wakeup Source 1 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC1_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_CLR_HWWK_SRC1_CLR_SHIFT)) & SLEEPCON1_HW_WAKE_CLR_HWWK_SRC1_CLR_MASK)

#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC2_CLR_MASK (0x4U)
#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC2_CLR_SHIFT (2U)
/*! HWWK_SRC2_CLR - eDMA Wakeup Source 2 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC2_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_CLR_HWWK_SRC2_CLR_SHIFT)) & SLEEPCON1_HW_WAKE_CLR_HWWK_SRC2_CLR_MASK)

#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC4_CLR_MASK (0x10U)
#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC4_CLR_SHIFT (4U)
/*! HWWK_SRC4_CLR - eDMA Wakeup Source 4 Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_HW_WAKE_CLR_HWWK_SRC4_CLR(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_HW_WAKE_CLR_HWWK_SRC4_CLR_SHIFT)) & SLEEPCON1_HW_WAKE_CLR_HWWK_SRC4_CLR_MASK)
/*! @} */

/*! @name SHARED_MASK0 - Shared Resources Mask */
/*! @{ */

#define SLEEPCON1_SHARED_MASK0_ADC0_MASK_MASK    (0x1U)
#define SLEEPCON1_SHARED_MASK0_ADC0_MASK_SHIFT   (0U)
/*! ADC0_MASK - Mask Bit of ADC0
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_ADC0_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_ADC0_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_ADC0_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_ACMP0_MASK_MASK   (0x2U)
#define SLEEPCON1_SHARED_MASK0_ACMP0_MASK_SHIFT  (1U)
/*! ACMP0_MASK - Mask Bit of ACMP0
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_ACMP0_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_ACMP0_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_ACMP0_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_MICFIL_MASK_MASK  (0x4U)
#define SLEEPCON1_SHARED_MASK0_MICFIL_MASK_SHIFT (2U)
/*! MICFIL_MASK - Mask Bit of MICFIL
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_MICFIL_MASK(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_MICFIL_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_MICFIL_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_LPI2C15_MASK_MASK (0x8U)
#define SLEEPCON1_SHARED_MASK0_LPI2C15_MASK_SHIFT (3U)
/*! LPI2C15_MASK - Mask Bit of LPI2C15
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_LPI2C15_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_LPI2C15_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_LPI2C15_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_GDET3_MASK_MASK   (0x20U)
#define SLEEPCON1_SHARED_MASK0_GDET3_MASK_SHIFT  (5U)
/*! GDET3_MASK - Mask Bit of GDET3
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_GDET3_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_GDET3_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_GDET3_MASK_MASK)

