Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SLEEPCON1.h
/*! @name SHA_MED_TCTRL0 - Media Domain Shared Resources Target Low-power Control */
/*! @{ */

#define SLEEPCON1_SHA_MED_TCTRL0_XSPI2_STOP_MASK (0x1U)
#define SLEEPCON1_SHA_MED_TCTRL0_XSPI2_STOP_SHIFT (0U)
/*! XSPI2_STOP - XSPI2 Stop Control
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_XSPI2_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_XSPI2_STOP_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_XSPI2_STOP_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_B_LPREQ_MASK (0x8U)
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_B_LPREQ_SHIFT (3U)
/*! LPSPI14_B_LPREQ - LPSPI14 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_B_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_B_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_F_LPREQ_MASK (0x10U)
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_F_LPREQ_SHIFT (4U)
/*! LPSPI14_F_LPREQ - LPSPI14 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_F_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_LPSPI14_F_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_B_LPREQ_MASK (0x40U)
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_B_LPREQ_SHIFT (6U)
/*! LPSPI16_B_LPREQ - LPSPI16 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_B_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_B_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_F_LPREQ_MASK (0x80U)
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_F_LPREQ_SHIFT (7U)
/*! LPSPI16_F_LPREQ - LPSPI16 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_F_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_LPSPI16_F_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_B_LPREQ_MASK (0x200U)
#define SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_B_LPREQ_SHIFT (9U)
/*! FLEXIO_B_LPREQ - FLEXIO Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_B_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_B_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_F_LPREQ_MASK (0x400U)
#define SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_F_LPREQ_SHIFT (10U)
/*! FLEXIO_F_LPREQ - FLEXIO Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_F_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_FLEXIO_F_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_NIC0_LPREQ_MASK (0x800U)
#define SLEEPCON1_SHA_MED_TCTRL0_NIC0_LPREQ_SHIFT (11U)
/*! NIC0_LPREQ - NIC_MEDIA0 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_NIC0_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_NIC0_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_NIC0_LPREQ_MASK)

#define SLEEPCON1_SHA_MED_TCTRL0_NIC1_LPREQ_MASK (0x1000U)
#define SLEEPCON1_SHA_MED_TCTRL0_NIC1_LPREQ_SHIFT (12U)
/*! NIC1_LPREQ - NIC_MEDIA1 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_MED_TCTRL0_NIC1_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MED_TCTRL0_NIC1_LPREQ_SHIFT)) & SLEEPCON1_SHA_MED_TCTRL0_NIC1_LPREQ_MASK)
/*! @} */

/*! @name SHA_SEN_TCTRL0 - Shared VDD1_SENSE Domain Targets Low-power Control */
/*! @{ */

#define SLEEPCON1_SHA_SEN_TCTRL0_ADC0_STOP_MASK  (0x1U)
#define SLEEPCON1_SHA_SEN_TCTRL0_ADC0_STOP_SHIFT (0U)
/*! ADC0_STOP - ADC0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_ADC0_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_ADC0_STOP_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_ADC0_STOP_MASK)

#define SLEEPCON1_SHA_SEN_TCTRL0_ACMP0_STOP_MASK (0x4U)
#define SLEEPCON1_SHA_SEN_TCTRL0_ACMP0_STOP_SHIFT (2U)
/*! ACMP0_STOP - ACMP0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_ACMP0_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_ACMP0_STOP_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_ACMP0_STOP_MASK)

#define SLEEPCON1_SHA_SEN_TCTRL0_MICFIL_STOP_MASK (0x8U)
#define SLEEPCON1_SHA_SEN_TCTRL0_MICFIL_STOP_SHIFT (3U)
/*! MICFIL_STOP - MICFIL Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_MICFIL_STOP(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_MICFIL_STOP_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_MICFIL_STOP_MASK)

#define SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_MASK (0x20U)
#define SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_SHIFT (5U)
/*! LPI2C15_B_LPREQ - LPI2C15 Bus Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_MASK)

#define SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_MASK (0x80U)
#define SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_SHIFT (7U)
/*! LPI2C15_F_LPREQ - LPI2C15 Function Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_MASK)

#define SLEEPCON1_SHA_SEN_TCTRL0_GDET3_LPREQ_MASK (0x200U)
#define SLEEPCON1_SHA_SEN_TCTRL0_GDET3_LPREQ_SHIFT (9U)
/*! GDET3_LPREQ - GDET3 Low-power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_GDET3_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_GDET3_LPREQ_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_GDET3_LPREQ_MASK)

#define SLEEPCON1_SHA_SEN_TCTRL0_RTC_STOP_MASK   (0x80000000U)
#define SLEEPCON1_SHA_SEN_TCTRL0_RTC_STOP_SHIFT  (31U)
/*! RTC_STOP - RTC0 and RTC1 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_SHA_SEN_TCTRL0_RTC_STOP(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_SEN_TCTRL0_RTC_STOP_SHIFT)) & SLEEPCON1_SHA_SEN_TCTRL0_RTC_STOP_MASK)
/*! @} */

/*! @name PRIVATE_CCTRL0 - Private Resources Controllers Low-power Control 0 */
/*! @{ */

#define SLEEPCON1_PRIVATE_CCTRL0_EDMA2_STOP_MASK (0x1U)
#define SLEEPCON1_PRIVATE_CCTRL0_EDMA2_STOP_SHIFT (0U)
/*! EDMA2_STOP - eDMA2 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_CCTRL0_EDMA2_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_CCTRL0_EDMA2_STOP_SHIFT)) & SLEEPCON1_PRIVATE_CCTRL0_EDMA2_STOP_MASK)

#define SLEEPCON1_PRIVATE_CCTRL0_EDMA3_STOP_MASK (0x2U)
#define SLEEPCON1_PRIVATE_CCTRL0_EDMA3_STOP_SHIFT (1U)
/*! EDMA3_STOP - eDMA3 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON1_PRIVATE_CCTRL0_EDMA3_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_CCTRL0_EDMA3_STOP_SHIFT)) & SLEEPCON1_PRIVATE_CCTRL0_EDMA3_STOP_MASK)
/*! @} */

