Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SLEEPCON1.h
#define SLEEPCON1_LP_HINT0_SAI3_F_LPHINT_MASK    (0x100000U)
#define SLEEPCON1_LP_HINT0_SAI3_F_LPHINT_SHIFT   (20U)
/*! SAI3_F_LPHINT - SAI3 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_SAI3_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_SAI3_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_SAI3_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LPI2C15_F_LPHINT_MASK (0x200000U)
#define SLEEPCON1_LP_HINT0_LPI2C15_F_LPHINT_SHIFT (21U)
/*! LPI2C15_F_LPHINT - LPI2C15 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LPI2C15_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LPI2C15_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LPI2C15_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LPSPI14_F_LPHINT_MASK (0x400000U)
#define SLEEPCON1_LP_HINT0_LPSPI14_F_LPHINT_SHIFT (22U)
/*! LPSPI14_F_LPHINT - LPSPI14 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LPSPI14_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LPSPI14_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LPSPI14_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LPSPI16_F_LPHINT_MASK (0x800000U)
#define SLEEPCON1_LP_HINT0_LPSPI16_F_LPHINT_SHIFT (23U)
/*! LPSPI16_F_LPHINT - LPSPI16 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LPSPI16_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LPSPI16_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LPSPI16_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_FLEXIO_F_LPHINT_MASK  (0x1000000U)
#define SLEEPCON1_LP_HINT0_FLEXIO_F_LPHINT_SHIFT (24U)
/*! FLEXIO_F_LPHINT - FLEXIO Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_FLEXIO_F_LPHINT(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_FLEXIO_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_FLEXIO_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_NIC0_IDLE0_MASK       (0x2000000U)
#define SLEEPCON1_LP_HINT0_NIC0_IDLE0_SHIFT      (25U)
/*! NIC0_IDLE0 - NIC_MEDIA0 Idle Status 0
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON1_LP_HINT0_NIC0_IDLE0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_NIC0_IDLE0_SHIFT)) & SLEEPCON1_LP_HINT0_NIC0_IDLE0_MASK)

#define SLEEPCON1_LP_HINT0_NIC0_IDLE1_MASK       (0x4000000U)
#define SLEEPCON1_LP_HINT0_NIC0_IDLE1_SHIFT      (26U)
/*! NIC0_IDLE1 - NIC_MEDIA0 Idle Status 1
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON1_LP_HINT0_NIC0_IDLE1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_NIC0_IDLE1_SHIFT)) & SLEEPCON1_LP_HINT0_NIC0_IDLE1_MASK)

#define SLEEPCON1_LP_HINT0_NIC1_IDLE0_MASK       (0x8000000U)
#define SLEEPCON1_LP_HINT0_NIC1_IDLE0_SHIFT      (27U)
/*! NIC1_IDLE0 - NIC_MEDIA1 Idle Status 0
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON1_LP_HINT0_NIC1_IDLE0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_NIC1_IDLE0_SHIFT)) & SLEEPCON1_LP_HINT0_NIC1_IDLE0_MASK)

#define SLEEPCON1_LP_HINT0_NIC1_IDLE1_MASK       (0x10000000U)
#define SLEEPCON1_LP_HINT0_NIC1_IDLE1_SHIFT      (28U)
/*! NIC1_IDLE1 - NIC_MEDIA1 Idle Status 1
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON1_LP_HINT0_NIC1_IDLE1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_NIC1_IDLE1_SHIFT)) & SLEEPCON1_LP_HINT0_NIC1_IDLE1_MASK)
/*! @} */

/*! @name LP_DENY0 - Low-Power Deny Status 0 */
/*! @{ */

#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM17_LPDENY_MASK (0x1U)
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM17_LPDENY_SHIFT (0U)
/*! LP_FLEXCOMM17_LPDENY - LP_FLEXCOMM17 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM17_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LP_FLEXCOMM17_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LP_FLEXCOMM17_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM18_LPDENY_MASK (0x2U)
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM18_LPDENY_SHIFT (1U)
/*! LP_FLEXCOMM18_LPDENY - LP_FLEXCOMM18 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM18_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LP_FLEXCOMM18_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LP_FLEXCOMM18_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM19_LPDENY_MASK (0x4U)
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM19_LPDENY_SHIFT (2U)
/*! LP_FLEXCOMM19_LPDENY - LP_FLEXCOMM19 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM19_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LP_FLEXCOMM19_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LP_FLEXCOMM19_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM20_LPDENY_MASK (0x8U)
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM20_LPDENY_SHIFT (3U)
/*! LP_FLEXCOMM20_LPDENY - LP_FLEXCOMM20 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LP_FLEXCOMM20_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LP_FLEXCOMM20_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LP_FLEXCOMM20_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_LPSPI14_LPDENY_MASK   (0x10U)
#define SLEEPCON1_LP_DENY0_LPSPI14_LPDENY_SHIFT  (4U)
/*! LPSPI14_LPDENY - LPSPI14 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LPSPI14_LPDENY(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LPSPI14_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LPSPI14_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_LPSPI16_LPDENY_MASK   (0x20U)
#define SLEEPCON1_LP_DENY0_LPSPI16_LPDENY_SHIFT  (5U)
/*! LPSPI16_LPDENY - LPSPI16 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LPSPI16_LPDENY(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LPSPI16_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LPSPI16_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_FLEXIO_LPDENY_MASK    (0x40U)
#define SLEEPCON1_LP_DENY0_FLEXIO_LPDENY_SHIFT   (6U)
/*! FLEXIO_LPDENY - FLEXIO LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_FLEXIO_LPDENY(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_FLEXIO_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_FLEXIO_LPDENY_MASK)

#define SLEEPCON1_LP_DENY0_LPI2C15_LPDENY_MASK   (0x80U)
#define SLEEPCON1_LP_DENY0_LPI2C15_LPDENY_SHIFT  (7U)
/*! LPI2C15_LPDENY - LPI2C15 LPDENY Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON1_LP_DENY0_LPI2C15_LPDENY(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_DENY0_LPI2C15_LPDENY_SHIFT)) & SLEEPCON1_LP_DENY0_LPI2C15_LPDENY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SLEEPCON1_Register_Masks */


/*!
 * @}
 */ /* end of group SLEEPCON1_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SLEEPCON1_H_ */

